/**
 * [课程项目注释]
 * 文件作用：保存卫星基本资料与 TLE 两行根数。
 * 引用知识：ES Module、JavaScript 数组与对象。
 * 数据说明：TLE 为课程演示用静态数据，页面运行时不访问远程接口。
 */
export const satellites = [
  {
    id: 1,
    shortName: 'CSS',
    name: '中国空间站',
    type: '载人空间站',
    description: '长期在轨运行的国家级太空实验室，用于开展空间科学、技术试验与航天员驻留任务。',
    color: '#62f3ff',
    tle1: '1 48274U 21035A   25315.32537269  .00030261  00000+0  36324-3 0  9999',
    tle2: '2 48274  41.4700 195.7222 0005200 218.1200 141.8900 15.61000000 30000'
  },
  {
    id: 2,
    shortName: 'ISS',
    name: '国际空间站',
    type: '载人空间站',
    description: '多国合作建设的大型近地轨道空间站，主要开展微重力科学实验和载人航天任务。',
    color: '#ffd166',
    tle1: '1 25544U 98067A   25315.51846080  .00015496  00000+0  27781-3 0  9997',
    tle2: '2 25544  51.6371 184.2118 0004414 235.8284 124.1974 15.50140675529911'
  },
  {
    id: 3,
    shortName: 'HST',
    name: '哈勃空间望远镜',
    type: '空间望远镜',
    description: '在地球大气层外开展天文观测的空间望远镜，可用于拍摄遥远天体并研究宇宙演化。',
    color: '#ae8cff',
    tle1: '1 20580U 90037B   25315.13274128  .00002141  00000+0  12290-3 0  9993',
    tle2: '2 20580  28.4698  76.1832 0002910  72.0100 288.1265 15.11573173999999'
  },
  {
    id: 4,
    shortName: 'FY-3F',
    name: '风云三号 F 星',
    type: '气象卫星',
    description: '太阳同步轨道气象卫星，可获取全球大气、地表和海洋观测数据，服务天气预报。',
    color: '#7ef29d',
    tle1: '1 57490U 23103A   25315.59493180  .00000425  00000+0  16230-3 0  9994',
    tle2: '2 57490  98.7096 207.1160 0001240 172.2000 187.9100 14.21110000100000'
  }
]

export default satellites